In [47]:
import numpy as np

In [48]:
import pandas as pd

In [49]:
data = np.random.rand(4,3)

In [50]:
data

array([[1.38307394e-01, 2.14281899e-01, 5.91552327e-03],
       [3.50102608e-04, 4.70318778e-01, 2.83956998e-01],
       [7.48364200e-01, 7.82353300e-01, 6.65662918e-01],
       [5.11404596e-01, 5.31680381e-01, 6.99782190e-01]])

In [51]:
data_frame = pd.DataFrame(data)

In [52]:
data_frame

          0         1         2
0  0.138307  0.214282  0.005916
1  0.000350  0.470319  0.283957
2  0.748364  0.782353  0.665663
3  0.511405  0.531680  0.699782

In [53]:
type(data_frame)

pandas.core.frame.DataFrame

In [54]:
type(data_frame[0])

pandas.core.series.Series

In [55]:
new_df = pd.DataFrame(data, index =["Atil","Zeynep","Atlas","Mehmet"],columns= ["Salary","Age","Seniority"])

In [56]:
new_df

          Salary       Age  Seniority
Atil    0.138307  0.214282   0.005916
Zeynep  0.000350  0.470319   0.283957
Atlas   0.748364  0.782353   0.665663
Mehmet  0.511405  0.531680   0.699782

In [57]:
new_df["Age"]

Atil      0.214282
Zeynep    0.470319
Atlas     0.782353
Mehmet    0.531680
Name: Age, dtype: float64

In [58]:
new_df["Age"]

Atil      0.214282
Zeynep    0.470319
Atlas     0.782353
Mehmet    0.531680
Name: Age, dtype: float64

In [59]:
new_df[["Age","Salary"]]

             Age    Salary
Atil    0.214282  0.138307
Zeynep  0.470319  0.000350
Atlas   0.782353  0.748364
Mehmet  0.531680  0.511405

In [60]:
new_df.loc["Atil"]

Salary       0.138307
Age          0.214282
Seniority    0.005916
Name: Atil, dtype: float64

In [61]:
new_df.iloc[1]

Salary       0.000350
Age          0.470319
Seniority    0.283957
Name: Zeynep, dtype: float64

In [62]:
new_df.iloc[0]

Salary       0.138307
Age          0.214282
Seniority    0.005916
Name: Atil, dtype: float64

In [63]:
new_df

          Salary       Age  Seniority
Atil    0.138307  0.214282   0.005916
Zeynep  0.000350  0.470319   0.283957
Atlas   0.748364  0.782353   0.665663
Mehmet  0.511405  0.531680   0.699782

In [64]:
new_df.iloc[:,1] #: bütün rowları seç

Atil      0.214282
Zeynep    0.470319
Atlas     0.782353
Mehmet    0.531680
Name: Age, dtype: float64

DATA MANİPÜLASYONU

In [65]:
new_df["Age"]

Atil      0.214282
Zeynep    0.470319
Atlas     0.782353
Mehmet    0.531680
Name: Age, dtype: float64

In [66]:
new_df["Extra"] = 10

In [67]:
new_df

          Salary       Age  Seniority  Extra
Atil    0.138307  0.214282   0.005916     10
Zeynep  0.000350  0.470319   0.283957     10
Atlas   0.748364  0.782353   0.665663     10
Mehmet  0.511405  0.531680   0.699782     10

In [68]:
new_df.drop("Extra", axis=1)

          Salary       Age  Seniority
Atil    0.138307  0.214282   0.005916
Zeynep  0.000350  0.470319   0.283957
Atlas   0.748364  0.782353   0.665663
Mehmet  0.511405  0.531680   0.699782

In [69]:
new_df

          Salary       Age  Seniority  Extra
Atil    0.138307  0.214282   0.005916     10
Zeynep  0.000350  0.470319   0.283957     10
Atlas   0.748364  0.782353   0.665663     10
Mehmet  0.511405  0.531680   0.699782     10

In [70]:
new_df.drop(columns=["Extra"], inplace=True)

In [71]:
type(new_df)

pandas.core.frame.DataFrame

In [72]:
new_df

          Salary       Age  Seniority
Atil    0.138307  0.214282   0.005916
Zeynep  0.000350  0.470319   0.283957
Atlas   0.748364  0.782353   0.665663
Mehmet  0.511405  0.531680   0.699782

In [73]:
new_df.drop("Mehmet")

          Salary       Age  Seniority
Atil    0.138307  0.214282   0.005916
Zeynep  0.000350  0.470319   0.283957
Atlas   0.748364  0.782353   0.665663

In [74]:
new_df.drop("Mehmet", axis=0)

          Salary       Age  Seniority
Atil    0.138307  0.214282   0.005916
Zeynep  0.000350  0.470319   0.283957
Atlas   0.748364  0.782353   0.665663

In [75]:
new_df

          Salary       Age  Seniority
Atil    0.138307  0.214282   0.005916
Zeynep  0.000350  0.470319   0.283957
Atlas   0.748364  0.782353   0.665663
Mehmet  0.511405  0.531680   0.699782

In [76]:
new_df.loc["Atlas"]

Salary       0.748364
Age          0.782353
Seniority    0.665663
Name: Atlas, dtype: float64

In [77]:
new_df.loc["Atlas"]["Salary"]

np.float64(0.7483642002523234)

In [78]:
new_df.loc["Atlas","Salary"] = 100

In [79]:
new_df

            Salary       Age  Seniority
Atil      0.138307  0.214282   0.005916
Zeynep    0.000350  0.470319   0.283957
Atlas   100.000000  0.782353   0.665663
Mehmet    0.511405  0.531680   0.699782

In [80]:
new_df > 0

        Salary   Age  Seniority
Atil      True  True       True
Zeynep    True  True       True
Atlas     True  True       True
Mehmet    True  True       True

In [81]:
boolean_frame = new_df <0

In [82]:
new_df[boolean_frame]

        Salary  Age  Seniority
Atil       NaN  NaN        NaN
Zeynep     NaN  NaN        NaN
Atlas      NaN  NaN        NaN
Mehmet     NaN  NaN        NaN

In [83]:
new_df[new_df >0]

            Salary       Age  Seniority
Atil      0.138307  0.214282   0.005916
Zeynep    0.000350  0.470319   0.283957
Atlas   100.000000  0.782353   0.665663
Mehmet    0.511405  0.531680   0.699782

In [84]:
new_df.reset_index()

    index      Salary       Age  Seniority
0    Atil    0.138307  0.214282   0.005916
1  Zeynep    0.000350  0.470319   0.283957
2   Atlas  100.000000  0.782353   0.665663
3  Mehmet    0.511405  0.531680   0.699782

In [85]:
reset_frame = new_df.reset_index()

In [86]:
reset_frame

    index      Salary       Age  Seniority
0    Atil    0.138307  0.214282   0.005916
1  Zeynep    0.000350  0.470319   0.283957
2   Atlas  100.000000  0.782353   0.665663
3  Mehmet    0.511405  0.531680   0.699782

In [87]:
reset_frame.loc[0]

index            Atil
Salary       0.138307
Age          0.214282
Seniority    0.005916
Name: 0, dtype: object

In [88]:
new_indices = ["Ati","Zey","Atl","Meh"]

In [93]:
new_df

            Salary       Age  Seniority
Atil      0.138307  0.214282   0.005916
Zeynep    0.000350  0.470319   0.283957
Atlas   100.000000  0.782353   0.665663
Mehmet    0.511405  0.531680   0.699782

In [94]:
new_df

            Salary       Age  Seniority
Atil      0.138307  0.214282   0.005916
Zeynep    0.000350  0.470319   0.283957
Atlas   100.000000  0.782353   0.665663
Mehmet    0.511405  0.531680   0.699782

In [97]:
new_df = new_df.reset_index()

In [101]:
print(new_df.index.name)

None

In [102]:
print(list(new_df.columns))

['index', 'Salary', 'Age', 'Seniority']

In [104]:
# Sütun isimlerindeki boşlukları siler ve hepsini standart hale getirir
new_df.columns = new_df.columns.str.strip()

In [105]:
# Şimdi tekrar deneyin
new_df = new_df.set_index("NewIndex")

KeyError: "None of ['NewIndex'] are in the columns"

In [106]:
##multi index

In [107]:
first_index = ["Simpson","Simpson","Simpson","South Park", "South Park", "South Park"]

In [108]:
inner_index = ["Honer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]

In [109]:
zipped_index = list(zip(first_index, inner_index))

In [110]:
zipped_index

[('Simpson', 'Honer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [113]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)

In [114]:
zipped_index

MultiIndex([(   'Simpson',   'Honer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [115]:
sample_values = np.ones((6,2))

In [116]:
big_df = pd.DataFrame(sample_values, index=zipped_index, columns = ["Age", "Salary"])

In [117]:
big_df

                    Age  Salary
Simpson    Honer    1.0     1.0
           Bart     1.0     1.0
           Marge    1.0     1.0
South Park Cartman  1.0     1.0
           Kenny    1.0     1.0
           Kyle     1.0     1.0

In [119]:
big_df.loc["Simpson"]

       Age  Salary
Honer  1.0     1.0
Bart   1.0     1.0
Marge  1.0     1.0

In [120]:
big_df.loc["Simpson"].loc["Honer"]

Age       1.0
Salary    1.0
Name: Honer, dtype: float64